-- MySQL dump 10.13  Distrib 8.0.43, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: salon_v1
-- ------------------------------------------------------
-- Server version	8.0.43

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `customers`
--

DROP TABLE IF EXISTS `customers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `customers` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `address` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` datetime(6) NOT NULL,
  `email` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `member_type` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `phone` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `customers`
--

LOCK TABLES `customers` WRITE;
/*!40000 ALTER TABLE `customers` DISABLE KEYS */;
INSERT INTO `customers` VALUES (1,NULL,'2025-10-27 03:41:43.579526','Tuantaitu123z@gmail.com','Thường','hoang tuan','0123654789','2025-10-27 03:41:43.579526'),(2,NULL,'2025-10-27 03:55:24.833654','1@gmail.com','Thường','dai','123698754','2025-10-27 03:55:24.833654'),(3,NULL,'2025-10-27 03:55:46.935488','2@gmail.com','Thường','tun','78','2025-10-27 03:55:46.935488'),(4,NULL,'2025-10-27 03:57:59.605333','3@gmail.com','Bạch kim','long','ấdsaa','2025-10-27 03:57:59.605333'),(5,NULL,'2025-10-27 12:45:45.817674','7@gmail.com','Vàng','tùng','9875624556','2025-10-27 12:45:45.817674'),(6,NULL,'2025-10-27 13:10:53.822368','gptvippro1@baret.pro','Bạch kim','Nguyễn Trung Tùng','0124781230','2025-10-27 13:10:53.822368'),(7,NULL,'2025-10-20 09:12:45.000000','a.nguyen@gmail.com','Thường','Nguyễn Anh','0912345678','2025-10-20 09:12:45.000000'),
                               (8,NULL,'2025-10-20 09:15:12.000000','b.tran@gmail.com','Vàng','Trần Bình','0987654321','2025-10-20 09:15:12.000000'),
                               (9,NULL,'2025-10-20 10:10:01.000000','c.le@gmail.com','Bạch kim','Lê Cường','0978456321','2025-10-20 10:10:01.000000'),
                               (10,NULL,'2025-10-20 10:35:55.000000','d.pham@gmail.com','Thường','Phạm Dũng','0965784321','2025-10-20 10:35:55.000000'),
                               (11,NULL,'2025-10-20 11:00:43.000000','e.vo@gmail.com','Kim cương','Võ Hương','0903456789','2025-10-20 11:00:43.000000'),
                               (12,NULL,'2025-10-20 11:24:32.000000','f.ngo@gmail.com','Thường','Ngô Phúc','0918765432','2025-10-20 11:24:32.000000'),
                               (13,NULL,'2025-10-20 11:46:29.000000','g.ho@gmail.com','Vàng','Hồ Quân','0925678456','2025-10-20 11:46:29.000000'),
                               (14,NULL,'2025-10-20 12:15:18.000000','h.vu@gmail.com','Bạch kim','Vũ Tài','0936789123','2025-10-20 12:15:18.000000'),
                               (15,NULL,'2025-10-20 12:38:57.000000','i.dinh@gmail.com','Thường','Đinh Ngọc','0945123987','2025-10-20 12:38:57.000000'),
                               (16,NULL,'2025-10-20 13:02:01.000000','j.truong@gmail.com','Kim cương','Trương Vỹ','0957896541','2025-10-20 13:02:01.000000'),
                               (17,NULL,'2025-10-21 09:00:00.000000','k.nguyen@gmail.com','Thường','Nguyễn Hải','0912233445','2025-10-21 09:00:00.000000'),
                               (18,NULL,'2025-10-21 09:15:00.000000','l.tran@gmail.com','Vàng','Trần Hòa','0923344556','2025-10-21 09:15:00.000000'),
                               (19,NULL,'2025-10-21 09:30:00.000000','m.le@gmail.com','Bạch kim','Lê Tuấn','0934455667','2025-10-21 09:30:00.000000'),
                               (20,NULL,'2025-10-21 09:45:00.000000','n.pham@gmail.com','Kim cương','Phạm Long','0945566778','2025-10-21 09:45:00.000000'),
                               (21,NULL,'2025-10-21 10:00:00.000000','o.vo@gmail.com','Thường','Võ Hưng','0956677889','2025-10-21 10:00:00.000000'),
                               (22,NULL,'2025-10-21 10:15:00.000000','p.ngo@gmail.com','Vàng','Ngô Khánh','0967788990','2025-10-21 10:15:00.000000'),
                               (23,NULL,'2025-10-21 10:30:00.000000','q.ho@gmail.com','Bạch kim','Hồ Hiếu','0978899001','2025-10-21 10:30:00.000000'),
                               (24,NULL,'2025-10-21 10:45:00.000000','r.vu@gmail.com','Kim cương','Vũ Lợi','0989900112','2025-10-21 10:45:00.000000'),
                               (25,NULL,'2025-10-21 11:00:00.000000','s.dinh@gmail.com','Thường','Đinh Quân','0991001223','2025-10-21 11:00:00.000000'),
                               (26,NULL,'2025-10-21 11:15:00.000000','t.truong@gmail.com','Vàng','Trương Huy','0901112334','2025-10-21 11:15:00.000000'),
                               (27,NULL,'2025-10-21 11:30:00.000000','u.nguyen@gmail.com','Bạch kim','Nguyễn Hà','0912223445','2025-10-21 11:30:00.000000'),
                               (28,NULL,'2025-10-21 11:45:00.000000','v.tran@gmail.com','Kim cương','Trần Khang','0923334556','2025-10-21 11:45:00.000000'),
                               (29,NULL,'2025-10-21 12:00:00.000000','w.le@gmail.com','Thường','Lê Đức','0934445667','2025-10-21 12:00:00.000000'),
                               (30,NULL,'2025-10-21 12:15:00.000000','x.pham@gmail.com','Vàng','Phạm Minh','0945556778','2025-10-21 12:15:00.000000'),
                               (31,NULL,'2025-10-21 12:30:00.000000','y.vo@gmail.com','Bạch kim','Võ Sơn','0956667889','2025-10-21 12:30:00.000000'),
                               (32,NULL,'2025-10-21 12:45:00.000000','z.ngo@gmail.com','Kim cương','Ngô Lộc','0967778990','2025-10-21 12:45:00.000000'),
                               (33,NULL,'2025-10-22 09:00:00.000000','a1.ho@gmail.com','Thường','Hồ Lâm','0978889001','2025-10-22 09:00:00.000000'),
                               (34,NULL,'2025-10-22 09:15:00.000000','a2.vu@gmail.com','Vàng','Vũ Ngọc','0989990112','2025-10-22 09:15:00.000000'),
                               (35,NULL,'2025-10-22 09:30:00.000000','a3.dinh@gmail.com','Bạch kim','Đinh Tài','0991001224','2025-10-22 09:30:00.000000'),
                               (36,NULL,'2025-10-22 09:45:00.000000','a4.truong@gmail.com','Kim cương','Trương Văn','0901112335','2025-10-22 09:45:00.000000'),
                               (37,NULL,'2025-10-22 10:00:00.000000','a5.nguyen@gmail.com','Thường','Nguyễn Hùng','0912223446','2025-10-22 10:00:00.000000'),
                               (38,NULL,'2025-10-22 10:15:00.000000','a6.tran@gmail.com','Vàng','Trần Tuấn','0923334557','2025-10-22 10:15:00.000000'),
                               (39,NULL,'2025-10-22 10:30:00.000000','a7.le@gmail.com','Bạch kim','Lê Nam','0934445668','2025-10-22 10:30:00.000000'),
                               (40,NULL,'2025-10-22 10:45:00.000000','a8.pham@gmail.com','Kim cương','Phạm An','0945556779','2025-10-22 10:45:00.000000'),
                               (41,NULL,'2025-10-22 11:00:00.000000','a9.vo@gmail.com','Thường','Võ Thái','0956667890','2025-10-22 11:00:00.000000'),
                               (42,NULL,'2025-10-22 11:15:00.000000','a10.ngo@gmail.com','Vàng','Ngô Nhân','0967778901','2025-10-22 11:15:00.000000'),
                               (43,NULL,'2025-10-22 11:30:00.000000','a11.ho@gmail.com','Bạch kim','Hồ Dương','0978889012','2025-10-22 11:30:00.000000'),
                               (44,NULL,'2025-10-22 11:45:00.000000','a12.vu@gmail.com','Kim cương','Vũ Lâm','0989990123','2025-10-22 11:45:00.000000'),
                               (45,NULL,'2025-10-22 12:00:00.000000','a13.dinh@gmail.com','Thường','Đinh Lợi','0991001234','2025-10-22 12:00:00.000000'),
                               (46,NULL,'2025-10-22 12:15:00.000000','a14.truong@gmail.com','Vàng','Trương Nhật','0901112345','2025-10-22 12:15:00.000000'),
                               (47,NULL,'2025-10-22 12:30:00.000000','a15.nguyen@gmail.com','Bạch kim','Nguyễn Thành','0912223456','2025-10-22 12:30:00.000000'),
                               (48,NULL,'2025-10-22 12:45:00.000000','a16.tran@gmail.com','Kim cương','Trần Vĩnh','0923334567','2025-10-22 12:45:00.000000'),
                               (49,NULL,'2025-10-22 13:00:00.000000','a17.le@gmail.com','Thường','Lê Hải','0934445678','2025-10-22 13:00:00.000000'),
                               (50,NULL,'2025-10-22 13:15:00.000000','a18.pham@gmail.com','Vàng','Phạm Khôi','0945556789','2025-10-22 13:15:00.000000'),
                               (51,NULL,'2025-10-22 13:30:00.000000','a19.vo@gmail.com','Bạch kim','Võ Nhất','0956667891','2025-10-22 13:30:00.000000'),
                               (52,NULL,'2025-10-22 13:45:00.000000','a20.ngo@gmail.com','Kim cương','Ngô Kỳ','0967778902','2025-10-22 13:45:00.000000'),
                               (53,NULL,'2025-10-23 09:00:00.000000','a21.ho@gmail.com','Thường','Hồ Đạt','0978889013','2025-10-23 09:00:00.000000'),
                               (54,NULL,'2025-10-23 09:15:00.000000','a22.vu@gmail.com','Vàng','Vũ Đình','0989990124','2025-10-23 09:15:00.000000'),
                               (55,NULL,'2025-10-23 09:30:00.000000','a23.dinh@gmail.com','Bạch kim','Đinh Phong','0991001235','2025-10-23 09:30:00.000000'),
                               (56,NULL,'2025-10-23 09:45:00.000000','a24.truong@gmail.com','Kim cương','Trương Quý','0901112346','2025-10-23 09:45:00.000000'),
                               (57,NULL,'2025-10-23 10:00:00.000000','a25.nguyen@gmail.com','Thường','Nguyễn Thiện','0912223457','2025-10-23 10:00:00.000000'),
                               (58,NULL,'2025-10-23 10:15:00.000000','a26.tran@gmail.com','Vàng','Trần Mạnh','0923334568','2025-10-23 10:15:00.000000'),
                               (59,NULL,'2025-10-23 10:30:00.000000','a27.le@gmail.com','Bạch kim','Lê Hậu','0934445679','2025-10-23 10:30:00.000000'),
                               (60,NULL,'2025-10-23 10:45:00.000000','a28.pham@gmail.com','Kim cương','Phạm Lộc','0945556790','2025-10-23 10:45:00.000000'),
                               (61,NULL,'2025-10-23 11:00:00.000000','a29.vo@gmail.com','Thường','Võ Nghĩa','0956667892','2025-10-23 11:00:00.000000'),
                               (62,NULL,'2025-10-23 11:15:00.000000','a30.ngo@gmail.com','Vàng','Ngô Trí','0967778903','2025-10-23 11:15:00.000000'),
                               (63,NULL,'2025-10-23 11:30:00.000000','a31.ho@gmail.com','Bạch kim','Hồ Minh','0978889014','2025-10-23 11:30:00.000000'),
                               (64,NULL,'2025-10-23 11:45:00.000000','a32.vu@gmail.com','Kim cương','Vũ Toàn','0989990125','2025-10-23 11:45:00.000000'),
                               (65,NULL,'2025-10-23 12:00:00.000000','a33.dinh@gmail.com','Thường','Đinh Khang','0991001236','2025-10-23 12:00:00.000000'),
                               (66,NULL,'2025-10-23 12:15:00.000000','a34.truong@gmail.com','Vàng','Trương Bảo','0901112347','2025-10-23 12:15:00.000000'),
                               (67,NULL,'2025-10-23 12:30:00.000000','a35.nguyen@gmail.com','Bạch kim','Nguyễn Phú','0912223458','2025-10-23 12:30:00.000000'),
                               (68,NULL,'2025-10-23 12:45:00.000000','a36.tran@gmail.com','Kim cương','Trần Lễ','0923334569','2025-10-23 12:45:00.000000'),
                               (69,NULL,'2025-10-23 13:00:00.000000','a37.le@gmail.com','Thường','Lê Đăng','0934445680','2025-10-23 13:00:00.000000'),
                               (70,NULL,'2025-10-23 13:15:00.000000','a38.pham@gmail.com','Vàng','Phạm Trí','0945556791','2025-10-23 13:15:00.000000'),
                               (71,NULL,'2025-10-23 13:30:00.000000','a39.vo@gmail.com','Bạch kim','Võ Cường','0956667893','2025-10-23 13:30:00.000000'),
                               (72,NULL,'2025-10-23 13:45:00.000000','a40.ngo@gmail.com','Kim cương','Ngô Nam','0967778904','2025-10-23 13:45:00.000000'),
                               (73,NULL,'2025-10-24 09:00:00.000000','a41.ho@gmail.com','Thường','Hồ Dũng','0978889015','2025-10-24 09:00:00.000000'),
                               (74,NULL,'2025-10-24 09:15:00.000000','a42.vu@gmail.com','Vàng','Vũ Phát','0989990126','2025-10-24 09:15:00.000000'),
                               (75,NULL,'2025-10-24 09:30:00.000000','a43.dinh@gmail.com','Bạch kim','Đinh Nam','0991001237','2025-10-24 09:30:00.000000'),
                               (76,NULL,'2025-10-24 09:45:00.000000','a44.truong@gmail.com','Kim cương','Trương Phúc','0901112348','2025-10-24 09:45:00.000000'),
                               (77,NULL,'2025-10-24 10:00:00.000000','a45.nguyen@gmail.com','Thường','Nguyễn Trọng','0912223459','2025-10-24 10:00:00.000000'),
                               (78,NULL,'2025-10-24 10:15:00.000000','a46.tran@gmail.com','Vàng','Trần Duy','0923334570','2025-10-24 10:15:00.000000'),
                               (79,NULL,'2025-10-24 10:30:00.000000','a47.le@gmail.com','Bạch kim','Lê Quốc','0934445681','2025-10-24 10:30:00.000000'),
                               (80,NULL,'2025-10-24 10:45:00.000000','a48.pham@gmail.com','Kim cương','Phạm Linh','0945556792','2025-10-24 10:45:00.000000'),
                               (81,NULL,'2025-10-24 11:00:00.000000','a49.vo@gmail.com','Thường','Võ Vinh','0956667894','2025-10-24 11:00:00.000000'),
                               (82,NULL,'2025-10-24 11:15:00.000000','a50.ngo@gmail.com','Vàng','Ngô Giang','0967778905','2025-10-24 11:15:00.000000'),
                               (83,NULL,'2025-10-24 11:30:00.000000','a51.ho@gmail.com','Bạch kim','Hồ Đoàn','0978889016','2025-10-24 11:30:00.000000'),
                               (84,NULL,'2025-10-24 11:45:00.000000','a52.vu@gmail.com','Kim cương','Vũ Triều','0989990127','2025-10-24 11:45:00.000000'),
                               (85,NULL,'2025-10-24 12:00:00.000000','a53.dinh@gmail.com','Thường','Đinh Hào','0991001238','2025-10-24 12:00:00.000000'),
                               (86,NULL,'2025-10-24 12:15:00.000000','a54.truong@gmail.com','Vàng','Trương Tín','0901112349','2025-10-24 12:15:00.000000'),
                               (87,NULL,'2025-10-24 12:30:00.000000','a55.nguyen@gmail.com','Bạch kim','Nguyễn Tâm','0912223460','2025-10-24 12:30:00.000000'),
                               (88,NULL,'2025-10-24 12:45:00.000000','a56.tran@gmail.com','Kim cương','Trần Sang','0923334571','2025-10-24 12:45:00.000000'),
                               (89,NULL,'2025-10-24 13:00:00.000000','a57.le@gmail.com','Thường','Lê Tính','0934445682','2025-10-24 13:00:00.000000'),
                               (90,NULL,'2025-10-24 13:15:00.000000','a58.pham@gmail.com','Vàng','Phạm Hào','0945556793','2025-10-24 13:15:00.000000'),
                               (91,NULL,'2025-10-24 13:30:00.000000','a59.vo@gmail.com','Bạch kim','Võ Thuận','0956667895','2025-10-24 13:30:00.000000'),
                               (92,NULL,'2025-10-24 13:45:00.000000','a60.ngo@gmail.com','Kim cương','Ngô Quang','0967778906','2025-10-24 13:45:00.000000'),
                               (93,NULL,'2025-10-25 09:00:00.000000','a61.ho@gmail.com','Thường','Hồ Thịnh','0978889017','2025-10-25 09:00:00.000000'),
                               (94,NULL,'2025-10-25 09:15:00.000000','a62.vu@gmail.com','Vàng','Vũ Lợi','0989990128','2025-10-25 09:15:00.000000'),
                               (95,NULL,'2025-10-25 09:30:00.000000','a63.dinh@gmail.com','Bạch kim','Đinh Trí','0991001239','2025-10-25 09:30:00.000000'),
                               (96,NULL,'2025-10-25 09:45:00.000000','a64.truong@gmail.com','Kim cương','Trương An','0901112350','2025-10-25 09:45:00.000000'),
                               (97,NULL,'2025-10-25 10:00:00.000000','a65.nguyen@gmail.com','Thường','Nguyễn Nhật','0912223461','2025-10-25 10:00:00.000000'),
                               (98,NULL,'2025-10-25 10:15:00.000000','a66.tran@gmail.com','Vàng','Trần Cường','0923334572','2025-10-25 10:15:00.000000'),
                               (99,NULL,'2025-10-25 10:30:00.000000','a67.le@gmail.com','Bạch kim','Lê Quý','0934445683','2025-10-25 10:30:00.000000'),
                               (100,NULL,'2025-10-25 10:45:00.000000','a68.pham@gmail.com','Kim cương','Phạm Tài','0945556794','2025-10-25 10:45:00.000000'),
                               (101,NULL,'2025-10-25 11:00:00.000000','a69.vo@gmail.com','Thường','Võ Phúc','0956667896','2025-10-25 11:00:00.000000'),
                               (102,NULL,'2025-10-25 11:15:00.000000','a70.ngo@gmail.com','Vàng','Ngô Lâm','0967778907','2025-10-25 11:15:00.000000'),
                               (103,NULL,'2025-10-25 11:30:00.000000','a71.ho@gmail.com','Bạch kim','Hồ Đăng','0978889018','2025-10-25 11:30:00.000000'),
                               (104,NULL,'2025-10-25 11:45:00.000000','a72.vu@gmail.com','Kim cương','Vũ Phúc','0989990129','2025-10-25 11:45:00.000000'),
                               (105,NULL,'2025-10-25 12:00:00.000000','a73.dinh@gmail.com','Thường','Đinh Đạt','0991001240','2025-10-25 12:00:00.000000'),
                               (106,NULL,'2025-10-25 12:15:00.000000','a74.truong@gmail.com','Vàng','Trương Thiện','0901112351','2025-10-25 12:15:00.000000');
/*!40000 ALTER TABLE `customers` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-10-27 16:27:41
